#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/eggs-projects/eggs-projects-eks-cluster/runs/run-BRQZvSywY87Pc6SH

Waiting for the plan to start...

Terraform v1.6.6
on linux_amd64
Initializing plugins and modules...
data.aws_ecrpublic_authorization_token.token: Reading...
data.aws_ecrpublic_authorization_token.token: Read complete after 0s [id=us-east-1]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-081e06fc36362b8a8]
data.aws_availability_zones.available: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.module.fargate_profile["karpenter"].data.aws_partition.current: Reading...
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.fargate_profile["kube-system"].data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.fargate_profile["karpenter"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/eggs-projects-eks/cluster]
module.karpenter.data.aws_caller_identity.current: Reading...
module.eks.module.fargate_profile["kube-system"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=470292911211]
module.eks.module.fargate_profile["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.fargate_profile["kube-system"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.fargate_profile["karpenter"].data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=470292911211]
module.eks.module.fargate_profile["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=3016102342]
module.karpenter.data.aws_partition.current: Reading...
module.eks.module.fargate_profile["kube-system"].data.aws_caller_identity.current: Reading...
module.karpenter.data.aws_caller_identity.current: Read complete after 0s [id=470292911211]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.module.fargate_profile["kube-system"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=3016102342]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.karpenter.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.fargate_profile["karpenter"].aws_iam_role.this[0]: Refreshing state... [id=karpenter-20231224194604362000000001]
module.eks.module.fargate_profile["karpenter"].data.aws_caller_identity.current: Read complete after 0s [id=470292911211]
module.eks.module.fargate_profile["kube-system"].aws_iam_role.this[0]: Refreshing state... [id=kube-system-20231224194604363000000002]
module.karpenter.data.aws_iam_policy_document.assume_role[0]: Reading...
module.eks.module.fargate_profile["kube-system"].data.aws_caller_identity.current: Read complete after 0s [id=470292911211]
module.karpenter.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2560088296]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=eggs-projects-eks-cluster-20231224194604364700000003]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::470292911211:assumed-role/eggs-projects-deploy-role/Session_GitHub_Actions]
module.eks.module.fargate_profile["kube-system"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=kube-system-20231224194604363000000002-20231224194604636900000006]
module.eks.module.fargate_profile["karpenter"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"]: Refreshing state... [id=karpenter-20231224194604362000000001-20231224194604595600000004]
module.eks.module.fargate_profile["karpenter"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=karpenter-20231224194604362000000001-20231224194604616300000005]
module.eks.module.fargate_profile["kube-system"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"]: Refreshing state... [id=kube-system-20231224194604363000000002-20231224194604654000000007]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=eggs-projects-eks-cluster-20231224194604364700000003-20231224194604678600000009]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=eggs-projects-eks-cluster-20231224194604364700000003-20231224194604657600000008]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2326598833]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=349aa3f7-20bc-465f-a484-f654d3ca0e3e]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/eggs-projects-eks]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::470292911211:policy/eggs-projects-eks-cluster-ClusterEncryption2023122419462545480000000b]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=eggs-projects-eks-cluster-20231224194604364700000003-2023122419462565200000000c]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0676c470bfabfa95c]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-082f7c9bd1d3e4920]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-001d4ee9b8b5ba1d5]
module.vpc.aws_subnet.intra[2]: Refreshing state... [id=subnet-0334545db4237c65c]
module.vpc.aws_subnet.intra[1]: Refreshing state... [id=subnet-00827ef7008b3ae01]
module.vpc.aws_subnet.intra[0]: Refreshing state... [id=subnet-01fb55113367f200a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0721bd2d6f2b01407]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0199ef7e92298aa38]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-077b949fa259ee233]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-036155f7fdb142315]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c3f0cfa7fec1f205]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0ef1e1e3d6045be9d]
module.vpc.aws_route_table.intra[0]: Refreshing state... [id=rtb-0eb49b620c8677f43]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-00e6c6d5539c94fc6]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0378a3853758ee51d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-031bc8a3cbb1fde1d]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-046aff2c8c175cd32]
module.vpc.aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-07bb1d433a7052fb7]
module.vpc.aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-02230023d3345c48b]
module.vpc.aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-0253af40113e30df4]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0ef1e1e3d6045be9d1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-004f6fe7c54578fa3]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-06b21508cb4a71956]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-046638a37401e29e3]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-00a9fd7c8d0f94e01]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-01515d6623f9983df]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-00bf58ec78e613541]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0d5c819af3dd8a2e3]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0721bd2d6f2b014071080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # helm_release.karpenter will be created
  + resource "helm_release" "karpenter" {
      + atomic                     = false
      + chart                      = "karpenter"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "karpenter"
      + namespace                  = "karpenter"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "oci://public.ecr.aws/karpenter"
      + repository_password        = (sensitive value)
      + repository_username        = "AWS"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "v0.33.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubectl_manifest.karpenter_example_deployment will be created
  + resource "kubectl_manifest" "karpenter_example_deployment" {
      + api_version             = "apps/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "inflate"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              name: inflate
            spec:
              replicas: 0
              selector:
                matchLabels:
                  app: inflate
              template:
                metadata:
                  labels:
                    app: inflate
                spec:
                  containers:
                  - image: public.ecr.aws/eks-distro/kubernetes/pause:3.7
                    name: inflate
                    resources:
                      requests:
                        cpu: 1
                  terminationGracePeriodSeconds: 0
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.karpenter_node_class will be created
  + resource "kubectl_manifest" "karpenter_node_class" {
      + api_version             = (known after apply)
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = (known after apply)
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = (known after apply)
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = (known after apply)
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.karpenter_node_pool will be created
  + resource "kubectl_manifest" "karpenter_node_pool" {
      + api_version             = "karpenter.sh/v1beta1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "NodePool"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "default"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.sh/v1beta1
            kind: NodePool
            metadata:
              name: default
            spec:
              disruption:
                consolidateAfter: 30s
                consolidationPolicy: WhenEmpty
              limits:
                cpu: 50
              template:
                spec:
                  nodeClassRef:
                    name: default
                  requirements:
                  - key: karpenter.k8s.aws/instance-category
                    operator: In
                    values:
                    - c
                    - m
                    - r
                  - key: karpenter.k8s.aws/instance-cpu
                    operator: In
                    values:
                    - "4"
                    - "8"
                    - "16"
                    - "32"
                  - key: karpenter.k8s.aws/instance-hypervisor
                    operator: In
                    values:
                    - nitro
                  - key: karpenter.k8s.aws/instance-generation
                    operator: Gt
                    values:
                    - "2"
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.27"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.27"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.27"
      + version            = (known after apply)
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["karpenter.sh/discovery"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "karpenter.sh/discovery"
      + resource_id = (known after apply)
      + value       = "eggs-projects-eks"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["org"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "org"
      + resource_id = (known after apply)
      + value       = "eggs-projects"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["owner"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "owner"
      + resource_id = (known after apply)
      + value       = "eggs-projects-eks-cluster"
    }

  # module.eks.aws_ec2_tag.cluster_primary_security_group["repo"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "repo"
      + resource_id = (known after apply)
      + value       = "eks-cluster"
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name           = "coredns"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "eggs-projects-eks"
      + configuration_values = jsonencode(
            {
              + computeType = "Fargate"
              + resources   = {
                  + limits   = {
                      + cpu    = "0.25"
                      + memory = "256M"
                    }
                  + requests = {
                      + cpu    = "0.25"
                      + memory = "256M"
                    }
                }
            }
        )
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "karpenter.sh/discovery" = "eggs-projects-eks"
          + "org"                    = "eggs-projects"
          + "owner"                  = "eggs-projects-eks-cluster"
          + "repo"                   = "eks-cluster"
        }
      + tags_all             = {
          + "environment"            = "development"
          + "karpenter.sh/discovery" = "eggs-projects-eks"
          + "org"                    = "eggs-projects"
          + "owner"                  = "eggs-projects-eks-cluster"
          + "repo"                   = "eks-cluster"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name           = "kube-proxy"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "eggs-projects-eks"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "karpenter.sh/discovery" = "eggs-projects-eks"
          + "org"                    = "eggs-projects"
          + "owner"                  = "eggs-projects-eks-cluster"
          + "repo"                   = "eks-cluster"
        }
      + tags_all             = {
          + "environment"            = "development"
          + "karpenter.sh/discovery" = "eggs-projects-eks"
          + "org"                    = "eggs-projects"
          + "owner"                  = "eggs-projects-eks-cluster"
          + "repo"                   = "eks-cluster"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name           = "vpc-cni"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "eggs-projects-eks"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + resolve_conflicts    = "OVERWRITE"
      + tags                 = {
          + "karpenter.sh/discovery" = "eggs-projects-eks"
          + "org"                    = "eggs-projects"
          + "owner"                  = "eggs-projects-eks-cluster"
          + "repo"                   = "eks-cluster"
        }
      + tags_all             = {
          + "environment"            = "development"
          + "karpenter.sh/discovery" = "eggs-projects-eks"
          + "org"                    = "eggs-projects"
          + "owner"                  = "eggs-projects-eks-cluster"
          + "repo"                   = "eks-cluster"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "eggs-projects-eks"
      + platform_version          = (known after apply)
      + role_arn                  = "arn:aws:iam::470292911211:role/eggs-projects-eks-cluster-20231224194604364700000003"
      + status                    = (known after apply)
      + tags                      = {
          + "karpenter.sh/discovery" = "eggs-projects-eks"
          + "org"                    = "eggs-projects"
          + "owner"                  = "eggs-projects-eks-cluster"
          + "repo"                   = "eks-cluster"
        }
      + tags_all                  = {
          + "environment"            = "development"
          + "karpenter.sh/discovery" = "eggs-projects-eks"
          + "org"                    = "eggs-projects"
          + "owner"                  = "eggs-projects-eks-cluster"
          + "repo"                   = "eks-cluster"
        }
      + version                   = "1.27"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = "arn:aws:kms:us-east-1:470292911211:key/349aa3f7-20bc-465f-a484-f654d3ca0e3e"
            }
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + subnet_ids                = [
              + "subnet-00827ef7008b3ae01",
              + "subnet-01fb55113367f200a",
              + "subnet-0334545db4237c65c",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name"                   = "eggs-projects-eks-eks-irsa"
          + "karpenter.sh/discovery" = "eggs-projects-eks"
          + "org"                    = "eggs-projects"
          + "owner"                  = "eggs-projects-eks-cluster"
          + "repo"                   = "eks-cluster"
        }
      + tags_all        = {
          + "Name"                   = "eggs-projects-eks-eks-irsa"
          + "environment"            = "development"
          + "karpenter.sh/discovery" = "eggs-projects-eks"
          + "org"                    = "eggs-projects"
          + "owner"                  = "eggs-projects-eks-cluster"
          + "repo"                   = "eks-cluster"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks.kubernetes_config_map_v1_data.aws_auth[0] will be created
  + resource "kubernetes_config_map_v1_data" "aws_auth" {
      + data          = (known after apply)
      + field_manager = "Terraform"
      + force         = true
      + id            = (known after apply)

      + metadata {
          + name      = "aws-auth"
          + namespace = "kube-system"
        }
    }

  # module.eks.time_sleep.this[0] will be created
  + resource "time_sleep" "this" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "cluster_certificate_authority_data" = (known after apply)
          + "cluster_endpoint"                   = (known after apply)
          + "cluster_name"                       = "eggs-projects-eks"
          + "cluster_version"                    = "1.27"
        }
    }

  # module.karpenter.data.aws_iam_policy_document.irsa[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ec2:CreateFleet",
              + "ec2:CreateLaunchTemplate",
              + "ec2:CreateTags",
              + "ec2:DescribeAvailabilityZones",
              + "ec2:DescribeImages",
              + "ec2:DescribeInstanceTypeOfferings",
              + "ec2:DescribeInstanceTypes",
              + "ec2:DescribeInstances",
              + "ec2:DescribeLaunchTemplates",
              + "ec2:DescribeSecurityGroups",
              + "ec2:DescribeSpotPriceHistory",
              + "ec2:DescribeSubnets",
              + "pricing:GetProducts",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DeleteLaunchTemplate",
              + "ec2:TerminateInstances",
            ]
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "eggs-projects-eks",
                ]
              + variable = "ec2:ResourceTag/karpenter.sh/discovery"
            }
        }
      + statement {
          + actions   = [
              + "ec2:RunInstances",
            ]
          + resources = [
              + "arn:aws:ec2:*:470292911211:launch-template/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "eggs-projects-eks",
                ]
              + variable = "ec2:ResourceTag/karpenter.sh/discovery"
            }
        }
      + statement {
          + actions   = [
              + "ec2:RunInstances",
            ]
          + resources = [
              + "arn:aws:ec2:*:470292911211:instance/*",
              + "arn:aws:ec2:*:470292911211:network-interface/*",
              + "arn:aws:ec2:*:470292911211:security-group/*",
              + "arn:aws:ec2:*:470292911211:spot-instances-request/*",
              + "arn:aws:ec2:*:470292911211:subnet/*",
              + "arn:aws:ec2:*:470292911211:volume/*",
              + "arn:aws:ec2:*::image/*",
              + "arn:aws:ec2:*::snapshot/*",
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + "arn:aws:ssm:*:*:parameter/aws/service/*",
            ]
        }
      + statement {
          + actions   = [
              + "eks:DescribeCluster",
            ]
          + resources = [
              + "arn:aws:eks:*:470292911211:cluster/eggs-projects-eks",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "iam:AddRoleToInstanceProfile",
              + "iam:CreateInstanceProfile",
              + "iam:DeleteInstanceProfile",
              + "iam:GetInstanceProfile",
              + "iam:RemoveRoleFromInstanceProfile",
              + "iam:TagInstanceProfile",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.karpenter.data.aws_iam_policy_document.irsa_assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "irsa_assume_role" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:karpenter:karpenter",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.karpenter.data.aws_iam_policy_document.queue[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "queue" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "SqsWrite"

          + principals {
              + identifiers = [
                  + "events.amazonaws.com",
                  + "sqs.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.karpenter.aws_cloudwatch_event_rule.this["health_event"] will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn            = (known after apply)
      + description    = "Karpenter interrupt - AWS health event"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "AWS Health Event",
                ]
              + source      = [
                  + "aws.health",
                ]
            }
        )
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "KarpenterHealthEvent-"
      + tags           = {
          + "ClusterName" = "eggs-projects-eks"
          + "org"         = "eggs-projects"
          + "owner"       = "eggs-projects-eks-cluster"
          + "repo"        = "eks-cluster"
        }
      + tags_all       = {
          + "ClusterName" = "eggs-projects-eks"
          + "environment" = "development"
          + "org"         = "eggs-projects"
          + "owner"       = "eggs-projects-eks-cluster"
          + "repo"        = "eks-cluster"
        }
    }

  # module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"] will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn            = (known after apply)
      + description    = "Karpenter interrupt - EC2 instance rebalance recommendation"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "EC2 Instance Rebalance Recommendation",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "KarpenterInstanceRebalance-"
      + tags           = {
          + "ClusterName" = "eggs-projects-eks"
          + "org"         = "eggs-projects"
          + "owner"       = "eggs-projects-eks-cluster"
          + "repo"        = "eks-cluster"
        }
      + tags_all       = {
          + "ClusterName" = "eggs-projects-eks"
          + "environment" = "development"
          + "org"         = "eggs-projects"
          + "owner"       = "eggs-projects-eks-cluster"
          + "repo"        = "eks-cluster"
        }
    }

  # module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"] will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn            = (known after apply)
      + description    = "Karpenter interrupt - EC2 instance state-change notification"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "EC2 Instance State-change Notification",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "KarpenterInstanceStateChange-"
      + tags           = {
          + "ClusterName" = "eggs-projects-eks"
          + "org"         = "eggs-projects"
          + "owner"       = "eggs-projects-eks-cluster"
          + "repo"        = "eks-cluster"
        }
      + tags_all       = {
          + "ClusterName" = "eggs-projects-eks"
          + "environment" = "development"
          + "org"         = "eggs-projects"
          + "owner"       = "eggs-projects-eks-cluster"
          + "repo"        = "eks-cluster"
        }
    }

  # module.karpenter.aws_cloudwatch_event_rule.this["spot_interupt"] will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn            = (known after apply)
      + description    = "Karpenter interrupt - EC2 spot instance interruption warning"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "EC2 Spot Instance Interruption Warning",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "KarpenterSpotInterrupt-"
      + tags           = {
          + "ClusterName" = "eggs-projects-eks"
          + "org"         = "eggs-projects"
          + "owner"       = "eggs-projects-eks-cluster"
          + "repo"        = "eks-cluster"
        }
      + tags_all       = {
          + "ClusterName" = "eggs-projects-eks"
          + "environment" = "development"
          + "org"         = "eggs-projects"
          + "owner"       = "eggs-projects-eks-cluster"
          + "repo"        = "eks-cluster"
        }
    }

  # module.karpenter.aws_cloudwatch_event_target.this["health_event"] will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "KarpenterInterruptionQueueTarget"
    }

  # module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"] will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "KarpenterInterruptionQueueTarget"
    }

  # module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"] will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "KarpenterInterruptionQueueTarget"
    }

  # module.karpenter.aws_cloudwatch_event_target.this["spot_interupt"] will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "KarpenterInterruptionQueueTarget"
    }

  # module.karpenter.aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "Karpenter-eggs-projects-eks-"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "org"   = "eggs-projects"
          + "owner" = "eggs-projects-eks-cluster"
          + "repo"  = "eks-cluster"
        }
      + tags_all    = {
          + "environment" = "development"
          + "org"         = "eggs-projects"
          + "owner"       = "eggs-projects-eks-cluster"
          + "repo"        = "eks-cluster"
        }
      + unique_id   = (known after apply)
    }

  # module.karpenter.aws_iam_policy.irsa[0] will be created
  + resource "aws_iam_policy" "irsa" {
      + arn         = (known after apply)
      + description = "Karpenter IAM role for service account"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "KarpenterIRSA-eggs-projects-eks-"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "org"   = "eggs-projects"
          + "owner" = "eggs-projects-eks-cluster"
          + "repo"  = "eks-cluster"
        }
      + tags_all    = {
          + "environment" = "development"
          + "org"         = "eggs-projects"
          + "owner"       = "eggs-projects-eks-cluster"
          + "repo"        = "eks-cluster"
        }
    }

  # module.karpenter.aws_iam_role.irsa[0] will be created
  + resource "aws_iam_role" "irsa" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "Karpenter IAM role for service account"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "KarpenterIRSA-eggs-projects-eks-"
      + path                  = "/"
      + tags                  = {
          + "org"   = "eggs-projects"
          + "owner" = "eggs-projects-eks-cluster"
          + "repo"  = "eks-cluster"
        }
      + tags_all              = {
          + "environment" = "development"
          + "org"         = "eggs-projects"
          + "owner"       = "eggs-projects-eks-cluster"
          + "repo"        = "eks-cluster"
        }
      + unique_id             = (known after apply)
    }

  # module.karpenter.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "Karpenter-eggs-projects-eks-"
      + path                  = "/"
      + tags                  = {
          + "org"   = "eggs-projects"
          + "owner" = "eggs-projects-eks-cluster"
          + "repo"  = "eks-cluster"
        }
      + tags_all              = {
          + "environment" = "development"
          + "org"         = "eggs-projects"
          + "owner"       = "eggs-projects-eks-cluster"
          + "repo"        = "eks-cluster"
        }
      + unique_id             = (known after apply)
    }

  # module.karpenter.aws_iam_role_policy_attachment.additional["AmazonSSMManagedInstanceCore"] will be created
  + resource "aws_iam_role_policy_attachment" "additional" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

  # module.karpenter.aws_iam_role_policy_attachment.irsa[0] will be created
  + resource "aws_iam_role_policy_attachment" "irsa" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.karpenter.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.karpenter.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.karpenter.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.karpenter.aws_sqs_queue.this[0] will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 300
      + name                              = "Karpenter-eggs-projects-eks"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags                              = {
          + "org"   = "eggs-projects"
          + "owner" = "eggs-projects-eks-cluster"
          + "repo"  = "eks-cluster"
        }
      + tags_all                          = {
          + "environment" = "development"
          + "org"         = "eggs-projects"
          + "owner"       = "eggs-projects-eks-cluster"
          + "repo"        = "eks-cluster"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.karpenter.aws_sqs_queue_policy.this[0] will be created
  + resource "aws_sqs_queue_policy" "this" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # module.eks.module.fargate_profile["karpenter"].aws_eks_fargate_profile.this[0] will be created
  + resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = "eggs-projects-eks"
      + fargate_profile_name   = "karpenter"
      + id                     = (known after apply)
      + pod_execution_role_arn = "arn:aws:iam::470292911211:role/karpenter-20231224194604362000000001"
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-00e6c6d5539c94fc6",
          + "subnet-031bc8a3cbb1fde1d",
          + "subnet-0378a3853758ee51d",
        ]
      + tags                   = {
          + "karpenter.sh/discovery" = "eggs-projects-eks"
          + "org"                    = "eggs-projects"
          + "owner"                  = "eggs-projects-eks-cluster"
          + "repo"                   = "eks-cluster"
        }
      + tags_all               = {
          + "environment"            = "development"
          + "karpenter.sh/discovery" = "eggs-projects-eks"
          + "org"                    = "eggs-projects"
          + "owner"                  = "eggs-projects-eks-cluster"
          + "repo"                   = "eks-cluster"
        }

      + selector {
          + namespace = "karpenter"
        }

      + timeouts {}
    }

  # module.eks.module.fargate_profile["kube-system"].aws_eks_fargate_profile.this[0] will be created
  + resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = "eggs-projects-eks"
      + fargate_profile_name   = "kube-system"
      + id                     = (known after apply)
      + pod_execution_role_arn = "arn:aws:iam::470292911211:role/kube-system-20231224194604363000000002"
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-00e6c6d5539c94fc6",
          + "subnet-031bc8a3cbb1fde1d",
          + "subnet-0378a3853758ee51d",
        ]
      + tags                   = {
          + "karpenter.sh/discovery" = "eggs-projects-eks"
          + "org"                    = "eggs-projects"
          + "owner"                  = "eggs-projects-eks-cluster"
          + "repo"                   = "eks-cluster"
        }
      + tags_all               = {
          + "environment"            = "development"
          + "karpenter.sh/discovery" = "eggs-projects-eks"
          + "org"                    = "eggs-projects"
          + "owner"                  = "eggs-projects-eks-cluster"
          + "repo"                   = "eks-cluster"
        }

      + selector {
          + namespace = "kube-system"
        }

      + timeouts {}
    }

Plan: 36 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_auth_configmap_yaml                          = <<-EOT
        apiVersion: v1
        kind: ConfigMap
        metadata:
          name: aws-auth
          namespace: kube-system
        data:
          mapRoles: |
            - rolearn: arn:aws:iam::470292911211:role/karpenter-20231224194604362000000001
              username: system:node:{{SessionName}}
              groups:
                - system:bootstrappers
                - system:nodes
                - system:node-proxier
            - rolearn: arn:aws:iam::470292911211:role/kube-system-20231224194604363000000002
              username: system:node:{{SessionName}}
              groups:
                - system:bootstrappers
                - system:nodes
                - system:node-proxier
    EOT
  + cluster_addons                                   = {
      + coredns    = {
          + addon_name                  = "coredns"
          + addon_version               = (known after apply)
          + arn                         = (known after apply)
          + cluster_name                = "eggs-projects-eks"
          + configuration_values        = jsonencode(
                {
                  + computeType = "Fargate"
                  + resources   = {
                      + limits   = {
                          + cpu    = "0.25"
                          + memory = "256M"
                        }
                      + requests = {
                          + cpu    = "0.25"
                          + memory = "256M"
                        }
                    }
                }
            )
          + created_at                  = (known after apply)
          + id                          = (known after apply)
          + modified_at                 = (known after apply)
          + preserve                    = null
          + resolve_conflicts           = "OVERWRITE"
          + resolve_conflicts_on_create = null
          + resolve_conflicts_on_update = null
          + service_account_role_arn    = null
          + tags                        = {
              + "karpenter.sh/discovery" = "eggs-projects-eks"
              + org                      = "eggs-projects"
              + owner                    = "eggs-projects-eks-cluster"
              + repo                     = "eks-cluster"
            }
          + tags_all                    = {
              + environment              = "development"
              + "karpenter.sh/discovery" = "eggs-projects-eks"
              + org                      = "eggs-projects"
              + owner                    = "eggs-projects-eks-cluster"
              + repo                     = "eks-cluster"
            }
          + timeouts                    = {
              + create = null
              + delete = null
              + update = null
            }
        }
      + kube-proxy = {
          + addon_name                  = "kube-proxy"
          + addon_version               = (known after apply)
          + arn                         = (known after apply)
          + cluster_name                = "eggs-projects-eks"
          + configuration_values        = (known after apply)
          + created_at                  = (known after apply)
          + id                          = (known after apply)
          + modified_at                 = (known after apply)
          + preserve                    = null
          + resolve_conflicts           = "OVERWRITE"
          + resolve_conflicts_on_create = null
          + resolve_conflicts_on_update = null
          + service_account_role_arn    = null
          + tags                        = {
              + "karpenter.sh/discovery" = "eggs-projects-eks"
              + org                      = "eggs-projects"
              + owner                    = "eggs-projects-eks-cluster"
              + repo                     = "eks-cluster"
            }
          + tags_all                    = {
              + environment              = "development"
              + "karpenter.sh/discovery" = "eggs-projects-eks"
              + org                      = "eggs-projects"
              + owner                    = "eggs-projects-eks-cluster"
              + repo                     = "eks-cluster"
            }
          + timeouts                    = {
              + create = null
              + delete = null
              + update = null
            }
        }
      + vpc-cni    = {
          + addon_name                  = "vpc-cni"
          + addon_version               = (known after apply)
          + arn                         = (known after apply)
          + cluster_name                = "eggs-projects-eks"
          + configuration_values        = (known after apply)
          + created_at                  = (known after apply)
          + id                          = (known after apply)
          + modified_at                 = (known after apply)
          + preserve                    = null
          + resolve_conflicts           = "OVERWRITE"
          + resolve_conflicts_on_create = null
          + resolve_conflicts_on_update = null
          + service_account_role_arn    = null
          + tags                        = {
              + "karpenter.sh/discovery" = "eggs-projects-eks"
              + org                      = "eggs-projects"
              + owner                    = "eggs-projects-eks-cluster"
              + repo                     = "eks-cluster"
            }
          + tags_all                    = {
              + environment              = "development"
              + "karpenter.sh/discovery" = "eggs-projects-eks"
              + org                      = "eggs-projects"
              + owner                    = "eggs-projects-eks-cluster"
              + repo                     = "eks-cluster"
            }
          + timeouts                    = {
              + create = null
              + delete = null
              + update = null
            }
        }
    }
  + cluster_arn                                      = (known after apply)
  + cluster_certificate_authority_data               = (known after apply)
  + cluster_endpoint                                 = (known after apply)
  + cluster_id                                       = (known after apply)
  + cluster_oidc_issuer_url                          = (known after apply)
  + cluster_platform_version                         = (known after apply)
  + cluster_primary_security_group_id                = (known after apply)
  + cluster_status                                   = (known after apply)
  + cluster_tls_certificate_sha1_fingerprint         = (known after apply)
  + fargate_profiles                                 = {
      + karpenter   = {
          + fargate_profile_arn                    = (known after apply)
          + fargate_profile_id                     = (known after apply)
          + fargate_profile_pod_execution_role_arn = "arn:aws:iam::470292911211:role/karpenter-20231224194604362000000001"
          + fargate_profile_status                 = (known after apply)
          + iam_role_arn                           = "arn:aws:iam::470292911211:role/karpenter-20231224194604362000000001"
          + iam_role_name                          = "karpenter-20231224194604362000000001"
          + iam_role_unique_id                     = "AROAW275EKRV477DJXESB"
        }
      + kube-system = {
          + fargate_profile_arn                    = (known after apply)
          + fargate_profile_id                     = (known after apply)
          + fargate_profile_pod_execution_role_arn = "arn:aws:iam::470292911211:role/kube-system-20231224194604363000000002"
          + fargate_profile_status                 = (known after apply)
          + iam_role_arn                           = "arn:aws:iam::470292911211:role/kube-system-20231224194604363000000002"
          + iam_role_name                          = "kube-system-20231224194604363000000002"
          + iam_role_unique_id                     = "AROAW275EKRVRWASFW6PZ"
        }
    }
  + karpenter_event_rules                            = {
      + health_event          = {
          + arn                 = (known after apply)
          + description         = "Karpenter interrupt - AWS health event"
          + event_bus_name      = "default"
          + event_pattern       = jsonencode(
                {
                  + detail-type = [
                      + "AWS Health Event",
                    ]
                  + source      = [
                      + "aws.health",
                    ]
                }
            )
          + id                  = (known after apply)
          + is_enabled          = null
          + name                = (known after apply)
          + name_prefix         = "KarpenterHealthEvent-"
          + role_arn            = null
          + schedule_expression = null
          + state               = null
          + tags                = {
              + ClusterName = "eggs-projects-eks"
              + org         = "eggs-projects"
              + owner       = "eggs-projects-eks-cluster"
              + repo        = "eks-cluster"
            }
          + tags_all            = {
              + ClusterName = "eggs-projects-eks"
              + environment = "development"
              + org         = "eggs-projects"
              + owner       = "eggs-projects-eks-cluster"
              + repo        = "eks-cluster"
            }
        }
      + instance_rebalance    = {
          + arn                 = (known after apply)
          + description         = "Karpenter interrupt - EC2 instance rebalance recommendation"
          + event_bus_name      = "default"
          + event_pattern       = jsonencode(
                {
                  + detail-type = [
                      + "EC2 Instance Rebalance Recommendation",
                    ]
                  + source      = [
                      + "aws.ec2",
                    ]
                }
            )
          + id                  = (known after apply)
          + is_enabled          = null
          + name                = (known after apply)
          + name_prefix         = "KarpenterInstanceRebalance-"
          + role_arn            = null
          + schedule_expression = null
          + state               = null
          + tags                = {
              + ClusterName = "eggs-projects-eks"
              + org         = "eggs-projects"
              + owner       = "eggs-projects-eks-cluster"
              + repo        = "eks-cluster"
            }
          + tags_all            = {
              + ClusterName = "eggs-projects-eks"
              + environment = "development"
              + org         = "eggs-projects"
              + owner       = "eggs-projects-eks-cluster"
              + repo        = "eks-cluster"
            }
        }
      + instance_state_change = {
          + arn                 = (known after apply)
          + description         = "Karpenter interrupt - EC2 instance state-change notification"
          + event_bus_name      = "default"
          + event_pattern       = jsonencode(
                {
                  + detail-type = [
                      + "EC2 Instance State-change Notification",
                    ]
                  + source      = [
                      + "aws.ec2",
                    ]
                }
            )
          + id                  = (known after apply)
          + is_enabled          = null
          + name                = (known after apply)
          + name_prefix         = "KarpenterInstanceStateChange-"
          + role_arn            = null
          + schedule_expression = null
          + state               = null
          + tags                = {
              + ClusterName = "eggs-projects-eks"
              + org         = "eggs-projects"
              + owner       = "eggs-projects-eks-cluster"
              + repo        = "eks-cluster"
            }
          + tags_all            = {
              + ClusterName = "eggs-projects-eks"
              + environment = "development"
              + org         = "eggs-projects"
              + owner       = "eggs-projects-eks-cluster"
              + repo        = "eks-cluster"
            }
        }
      + spot_interupt         = {
          + arn                 = (known after apply)
          + description         = "Karpenter interrupt - EC2 spot instance interruption warning"
          + event_bus_name      = "default"
          + event_pattern       = jsonencode(
                {
                  + detail-type = [
                      + "EC2 Spot Instance Interruption Warning",
                    ]
                  + source      = [
                      + "aws.ec2",
                    ]
                }
            )
          + id                  = (known after apply)
          + is_enabled          = null
          + name                = (known after apply)
          + name_prefix         = "KarpenterSpotInterrupt-"
          + role_arn            = null
          + schedule_expression = null
          + state               = null
          + tags                = {
              + ClusterName = "eggs-projects-eks"
              + org         = "eggs-projects"
              + owner       = "eggs-projects-eks-cluster"
              + repo        = "eks-cluster"
            }
          + tags_all            = {
              + ClusterName = "eggs-projects-eks"
              + environment = "development"
              + org         = "eggs-projects"
              + owner       = "eggs-projects-eks-cluster"
              + repo        = "eks-cluster"
            }
        }
    }
  + karpenter_instance_profile_arn                   = (known after apply)
  + karpenter_instance_profile_id                    = (known after apply)
  + karpenter_instance_profile_name                  = (known after apply)
  + karpenter_instance_profile_unique                = (known after apply)
  + karpenter_irsa_arn                               = (known after apply)
  + karpenter_irsa_name                              = (known after apply)
  + karpenter_irsa_unique_id                         = (known after apply)
  + karpenter_queue_arn                              = (known after apply)
  + karpenter_queue_url                              = (known after apply)
  + karpenter_role_arn                               = (known after apply)
  + karpenter_role_name                              = (known after apply)
  + karpenter_role_unique_id                         = (known after apply)
  + oidc_provider                                    = (known after apply)
  + oidc_provider_arn                                = (known after apply)
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named
│ "route53_hosted_zone_name" but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-BRQZvSywY87Pc6SH/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with module.eks.aws_eks_addon.this["vpc-cni"],
│   on .terraform/modules/eks/main.tf line 400, in resource "aws_eks_addon" "this":
│  400:   resolve_conflicts        = try(each.value.resolve_conflicts, "OVERWRITE")
│ 
│ The "resolve_conflicts" attribute can't be set to "PRESERVE" on initial
│ resource creation. Use "resolve_conflicts_on_create" and/or
│ "resolve_conflicts_on_update" instead
│ 
│ (and 2 more similar warnings elsewhere)
╵

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 23 estimated
           $1.00000000000000272/mo +$0.0

```

</details>

*Pushed by: @renovate[bot], Action: `pull_request`*